# Tap Commands: Adding additional repositories for formulae:
tap "codeclimate/formulae"
# ElasticSearch formulae
tap "elastic/tap"
# Tap for espanso, a text expander written in Rust
tap "federico-terzi/espanso"
# GitHub CLI tap for the GitHub command-line tool
tap "github/gh"
# Homebrew Bundle tap for managing multiple packages together
tap "homebrew/bundle"
# Homebrew Cask tap for GUI application installation
tap "homebrew/cask"
# Homebrew Cask Fonts tap for font-related packages
tap "homebrew/cask-fonts"
# Homebrew Cask Versions tap for different versions of applications
tap "homebrew/cask-versions"
# Default Homebrew tap with essential packages
tap "homebrew/core"
# Homebrew Services tap for managing services through Homebrew
tap "homebrew/services"
# Custom tap containing additional formulae
tap "melonamin/formulae"
# MongoDB tap for MongoDB-related formulae
tap "mongodb/brew"
# PlanetScale tap for PlanetScale-related formulae
tap "planetscale/tap"
# Brew Commands: Installing CLI Tools and Utilities:
# Search tool, optimized for programmers
brew "ack"
# AWS Command Line Interface
brew "awscli"
# Latest version of Bash
brew "bash"
# Bash completion for Homebrew formulae
brew "bash-completion@2"
# Cat(1) clone with syntax highlighting and Git integration
brew "bat"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Remove large files or passwords from Git history
brew "bfg"
# Bash completion for Homebrew Cask
brew "brew-cask-completion"
# Fast and easy-to-use web server with automatic HTTPS
brew "caddy", restart_service: true
# Tool to obtain and renew Let's Encrypt SSL certificates
brew "certbot"
# Create and view interactive cheatsheets on the command-line
brew "cheat"
# Regular expressions library
brew "oniguruma"
# GNU core utilities (prefixed with 'g' by default)
brew "coreutils"
# Environment switcher for the shell
brew "direnv"
# Disk Usage/Free Utility - a more modern 'df' alternative
brew "duf"
# More intuitive version of 'du' (disk usage)
brew "dust"
# Text expander written in Rust
brew "espanso"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Node.js version manager
brew "fnm"
# Command-line fuzzy finder
brew "fzf"
# Bash completion for RubyGems
brew "gem-completion"
# GitHub CLI
brew "gh"
# Distributed version control system
brew "git"
# Syntax-highlighting pager for Git
brew "git-delta"
# Extra git commands
brew "git-extras"
# Rewrite repositories to modernize history and more
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg2"
# Ping, but with a graph
brew "gping"
# GNU grep, egrep, and fgrep
brew "grep"
# Command-line HTML processor
brew "htmlq"
# Improved top (interactive process viewer)
brew "htop"
# Apache HTTP Server
brew "httpd", restart_service: true
# HTTP client for the command line
brew "httpie"
# GitHub command-line tools
brew "hub"
# Automated installation of Microsoft IE AppCompat VMs
brew "ievms"
# Latest Python 3.9 version
brew "python@3.9"
# HEIF file format decoder and encoder
brew "libheif"
# Image processing tools and libraries
brew "imagemagick"
# Command-line JSON processor
brew "jq"
# High-quality MPEG audio layer III (MP3) encoder
brew "lame"
# Bash completion for launchctl
brew "launchctl-completion"
# YAML parser and emitter library
brew "libyaml"
# MariaDB database server
brew "mariadb", restart_service: true
# Mac App Store command-line interface
brew "mas"
# Like awk, sed, cut, join, and sort for name-indexed data
brew "miller"
# Create locally-trusted development certificates
brew "mkcert"
# MongoDB shell with enhancements
brew "mongosh"
# MongoDB Community Edition
brew "mongodb/brew/mongodb-community"
# Web server
brew "nginx"
# Network grep
brew "ngrep"
# Mozilla Network Security Services
brew "nss"
# Cryptography and SSL/TLS Toolkit (version 3.x)
brew "openssl@3"
# Simple PIN-entry dialog for GnuPG
brew "pinentry-mac"
# Top-like utility for monitoring processes
brew "procs"
# Python version management
brew "pyenv-virtualenv"
# Ruby version management
brew "rbenv"
# Perl-powered file rename script
brew "rename"
# Line-oriented search tool
brew "ripgrep"
# Terminal multiplexer
brew "screen"
# Intuitive find & replace CLI
brew "sd"
# Command-line interface for testing internet bandwidth
brew "speedtest-cli"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Tool to build, change, and version infrastructure
brew "terraform"
# Magnificent app that corrects your previous console command
brew "thefuck"
# Display directory tree, in color
brew "tree"
# Text-mode interface for Git repositories
brew "tig"
# Improved version of the standard Unix text editor
brew "vim"
# JavaScript tool manager
brew "volta"
# File system watcher
brew "watchman"
# Simplified and community-driven man pages
brew "tldr"
# Internet file retriever
brew "wget"
# Fast, reliable, and secure dependency management
brew "yarn"
# Bash completion for Yarn
brew "yarn-completion"
# YouTube-DL fork with additional features and fixes
brew "yt-dlp"
# Fast, flexible directory jumper
brew "zoxide"
# Clojure programming language, a dynamic, general-purpose language, combining the approachability and interactive development of a scripting language with an efficient and robust infrastructure for multithreaded programming
brew "clojure"
# Elixir programming language, a dynamic, functional language designed for building scalable and maintainable applications, leveraging the Erlang VM, known for running low-latency, distributed, and fault-tolerant systems.
brew "elixir"
# Ruby programming language
brew "ruby"
# Lua programming language
brew "lua"
# Node.js JavaScript runtime
brew "node"
# Go programming language
brew "go"
# Language for application-scale JavaScript development
brew "typescript"
# Rust programming language
brew "rust"
# Latest PHP version
brew "php", restart_service: true
# Latest Python version
brew "python"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Dependency Manager for PHP
brew "composer"
# Command-line interface for WordPress
brew "wp-cli"
# MongoDB Shell: An interactive JavaScript interface to MongoDB, enabling you to query and update data as well as perform administrative operations.
brew "mongosh"
# Elixir language server: An implementation of Microsoft's Language Server Protocol for the Elixir programming language, providing features like auto-completion, go to definition, and error checking to editors that support it.
brew "elixir-ls"
# MongoDB Community Edition: The open source version of MongoDB, a document-oriented database designed for ease of development and scaling.
brew "mongodb/brew/mongodb-community"
# Drop-in replacement for MySQL
brew "mariadb", restart_service: true
# Terminal emulator
cask "iterm2"
# Collaboration platform for API development
cask "postman"
# HTTP and GraphQL Client
cask "insomnia"
# Host-based application firewall
cask "little-snitch"
# Git client focusing on power and productivity
cask "tower"
# MongoDB management tool
cask "robo-3t"
# Object-relational database system
brew "postgresql"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# MySQL/MariaDB database management platform
cask "sequel-pro"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
# MongoDB management tool
cask "robo-3t"
# Electronics prototyping platform
cask "arduino"
# Open-source code editor
cask "visual-studio-code"
# Password manager
cask "lastpass"
# Browsers:
# Chromium: An open-source web browser project from which Google Chrome draws its source code.
cask "chromium"
# Microsoft Edge: Microsoft's fast, secure, and modern web browser built on the open source Chromium project.
cask "microsoft-edge"
# Firefox: Mozilla's popular open-source web browser known for its speed, lightness, and add-on community.
cask "firefox"
# Firefox Developer Edition: Offers the latest features and tools you need to build for the open web; includes experimental features such as the Multi-line Console Editor and WebSocket Inspector.
cask "firefox-developer-edition"
# Google Chrome: Google's web browser, known for its speed and simplicity.
cask "google-chrome"
# File sync software
cask "google-drive"
# Commincation
# Discord: All-in-one voice, video and text chat for gamers that's free, secure, and works on both your desktop and phone.
cask "discord"
# Slack: A collaboration hub.
cask "slack"
# Gather: A gamified collaboration hub.
cask "gather"
# Fig is a command-line utility designed to enhance and improve the user experience when working with the terminal
cask "fig"
# Git GUI
cask "github"
# Software modeler
cask "staruml"
# Apache distribution containing MySQL, PHP, and Perl
cask "xampp"
# Synergy, the keyboard and mouse sharing tool
brew "synergy-core"
# Simple shortcut menu
cask "shuttle"
# Application launcher and productivity software
cask "alfred"
# Test localhost and staging websites
cask "browserstacklocal"
# Two-factor authentication software
cask "authy"
# Server and cloud storage browser
cask "cyberduck"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# GraphQL IDE for better development workflows
cask "graphql-playground"
# Tool to optimize images to a smaller size
cask "imageoptim"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Interface for reading and syncing eBooks
cask "kindle"
# App to write, plan, collaborate, and get organized
cask "notion"
# Screen measuring tool
cask "pixelsnap"
# Color Pickers
# Material Design Color Picker: A color picker built by Google that helps you choose colors according to Material Design guidelines.
cask "colorpicker-materialdesign"
# Propicker: A macOS color picker app that provides many different ways to pick color and copy it directly into clipboard.
cask "colorpicker-propicker"
# Skala Color: A compact and feature-rich macOS color picker that works with a huge variety of formats, covering everything you’re likely to need for web, iOS, Android, and macOS development.
cask "colorpicker-skalacolor"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# QuickLook generator for Markdown files
cask "qlmarkdown"
# QLPrettyPatch
cask "qlprettypatch"
# QuickLook plugin for CSV files
cask "quicklook-csv"
# QuickLook plugin for JSON files
cask "quicklook-json"
# Control your tools with a few keystrokes
cask "raycast"
# Suspicious Package: An application that allows you to inspect the contents of a macOS Installer package (.pkg) before you install it to ensure it doesn't contain anything unexpected or malicious.
cask "suspicious-package"
# Menu bar customization tool
cask "swiftbar"
# Task manager for teams
cask "taskade"
# Unpacks archive files
cask "the-unarchiver"
# Tool to hide menu bar icons
cask "vanilla"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Typography
cask "font-dejavu-sans-mono-for-powerline"
cask "font-fira-code-nerd-font"
cask "font-inconsolata"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-for-powerline"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-ubuntu"
